Repository: mateitudor/mt-gfw-coupon_generator
Catalog: languages/gravity-forms-woocommerce-coupon-generator-*.po
Languages: ro_ro

source: Gravity Forms WooCommerce Coupon Generator requires both Gravity Forms and WooCommerce to be installed and activated.
ro_ro: Gravity Forms WooCommerce Coupon Generator necesită atât Gravity Forms cât și WooCommerce să fie instalate și activate.

source: Back to List
ro_ro: Înapoi la listă

source: Basic Information
ro_ro: Informații de bază

source: Generator ID
ro_ro: ID Generator

source: This is the unique identifier for this generator.
ro_ro: Acesta este identificatorul unic pentru acest generator.

source: Title
ro_ro: Titlu

source: Coupon Description
ro_ro: Descriere cupon

source: Enter a description for the generated coupons...
ro_ro: Introduceți o descriere pentru cupoanele generate...

source: This description will be saved to the WooCommerce coupon and can be used to identify the purpose or source of the coupon. It will be visible in the WooCommerce admin area.
ro_ro: Această descriere va fi salvată în cuponul WooCommerce și poate fi folosită pentru a identifica scopul sau sursa cuponului. Va fi vizibilă în zona de administrare WooCommerce.

source: Gravity Form
ro_ro: Formular Gravity

source: Select a form
ro_ro: Selectează un formular

source: Email Field
ro_ro: Câmp email

source: Select email field
ro_ro: Selectează câmpul de email

source: Name Field
ro_ro: Câmp nume

source: Select name field
ro_ro: Selectează câmpul de nume

source: Coupon Settings
ro_ro: Setări cupon

source: Coupon Type
ro_ro: Tip cupon

source: Random
ro_ro: Aleator

source: From Form Field
ro_ro: Din câmpul formularului

source: Coupon Field
ro_ro: Câmp cupon

source: Select coupon field
ro_ro: Selectează câmpul cuponului

source: Select any form field that will contain the coupon code.
ro_ro: Selectează orice câmp de formular care va conține codul cuponului.

source: Coupon Length
ro_ro: Lungime cupon

source: Coupon Prefix
ro_ro: Prefix cupon

source: Coupon Suffix
ro_ro: Sufix cupon

source: Coupon Separator
ro_ro: Separator cupon

source: Character to separate prefix/suffix from the coupon code (e.g., "-")
ro_ro: Caracter pentru a separa prefixul/sufixul de codul cuponului (ex: "-")

source: Discount Settings
ro_ro: Setări reducere

source: Discount Type
ro_ro: Tip reducere

source: Discount Amount
ro_ro: Sumă reducere

source: Usage Restrictions
ro_ro: Restricții utilizare

source: Individual Use
ro_ro: Utilizare individuală

source: Check this box if the coupon cannot be used in conjunction with other coupons.
ro_ro: Bifați această casetă dacă cuponul nu poate fi folosit împreună cu alte cupoane.

source: Usage Limit Per Coupon
ro_ro: Limită utilizare per cupon

source: Leave empty for unlimited usage. Set to 0 for unlimited usage.
ro_ro: Lăsați gol pentru utilizare nelimitată. Setați la 0 pentru utilizare nelimitată.

source: Usage Limit Per User
ro_ro: Limită utilizare per utilizator

source: Leave empty for unlimited usage per user. Set to 0 for unlimited usage per user.
ro_ro: Lăsați gol pentru utilizare nelimitată per utilizator. Setați la 0 pentru utilizare nelimitată per utilizator.

source: Minimum Amount
ro_ro: Sumă minimă

source: Leave empty for no minimum amount. Set to 0 for no minimum amount.
ro_ro: Lăsați gol pentru fără sumă minimă. Setați la 0 pentru fără sumă minimă.

source: Maximum Amount
ro_ro: Sumă maximă

source: Leave empty for no maximum amount. Set to 0 for no maximum amount.
ro_ro: Lăsați gol pentru fără sumă maximă. Setați la 0 pentru fără sumă maximă.

source: Exclude Sale Items
ro_ro: Exclude produse la reducere

source: Check this box if the coupon should not apply to items on sale.
ro_ro: Bifați această casetă dacă cuponul nu ar trebui să se aplice la produsele la reducere.

source: Allow Free Shipping
ro_ro: Permite transport gratuit

source: Check this box if the coupon grants free shipping.
ro_ro: Bifați această casetă dacă cuponul oferă transport gratuit.

source: Expiry Days
ro_ro: Zile expirare

source: Number of days until the coupon expires. Set to 0 for no expiry.
ro_ro: Numărul de zile până la expirarea cuponului. Setați la 0 pentru fără expirare.

source: Products
ro_ro: Produse

source: Search for a product…
ro_ro: Caută un produs…

source: Products that the coupon will be applied to, or that need to be in the cart in order for the "Fixed cart discount" to be applied.
ro_ro: Produsele la care se va aplica cuponul, sau care trebuie să fie în coș pentru ca reducerea "Fixă pentru coș" să se aplice.

source: Exclude Products
ro_ro: Exclude produse

source: Products that the coupon will not be applied to, or that cannot be in the cart in order for the "Fixed cart discount" to be applied.
ro_ro: Produsele la care nu se va aplica cuponul, sau care nu pot fi în coș pentru ca reducerea "Fixă pentru coș" să se aplice.

source: Product Categories
ro_ro: Categorii produse

source: Any category
ro_ro: Orice categorie

source: Product categories that the coupon will be applied to, or that need to be in the cart in order for the "Fixed cart discount" to be applied.
ro_ro: Categoriile de produse la care se va aplica cuponul, sau care trebuie să fie în coș pentru ca reducerea "Fixă pentru coș" să se aplice.

source: Exclude Categories
ro_ro: Exclude categorii

source: Email Settings
ro_ro: Setări email

source: Send Email
ro_ro: Trimite email

source: Send email with coupon code to the user
ro_ro: Trimite email cu codul cuponului către utilizator

source: Email Subject
ro_ro: Subiect email

source: Email Message
ro_ro: Mesaj email

source: Available placeholders:
ro_ro: Placeholder-e disponibile:

source: Basic:
ro_ro: De bază:

source: Discount Settings:
ro_ro: Setări reducere:

source: Usage Restrictions:
ro_ro: Restricții utilizare:

source: Amount Restrictions:
ro_ro: Restricții sumă:

source: Product Restrictions:
ro_ro: Restricții produse:

source: Category Restrictions:
ro_ro: Restricții categorii:

source: Placeholder Examples:
ro_ro: Exemple placeholder:

source: From Name
ro_ro: De la nume

source: From Email
ro_ro: De la email

source: Use WooCommerce Email Template
ro_ro: Folosește șablonul de email WooCommerce

source: Use WooCommerce email template for styling
ro_ro: Folosește șablonul de email WooCommerce pentru stilizare

source: Advanced Settings
ro_ro: Setări avansate

source: Debug Mode
ro_ro: Mod debug

source: Enable debug mode for troubleshooting
ro_ro: Activează modul debug pentru depanare

source: Generators
ro_ro: Generatoare

source: Coupon Generator
ro_ro: Generator Cupoane

source: Add New
ro_ro: Adaugă Nou

source: Add New Generator
ro_ro: Adaugă Generator Nou

source: You do not have sufficient permissions to access this page.
ro_ro: Nu aveți permisiuni suficiente pentru a accesa această pagină.

source: Invalid generator ID.
ro_ro: ID generator invalid.

source: Please fill in all required fields.
ro_ro: Vă rugăm să completați toate câmpurile obligatorii.

source: Error adding generator.
ro_ro: Eroare la adăugarea generatorului.

source: Error updating generator.
ro_ro: Eroare la actualizarea generatorului.

source: Generator added successfully.
ro_ro: Generator adăugat cu succes.

source: Generator updated successfully.
ro_ro: Generator actualizat cu succes.

source: Title is required.
ro_ro: Titlul este obligatoriu.

source: Form ID and Email Field are required.
ro_ro: ID-ul formularului și câmpul de email sunt obligatorii.

source: Invalid form ID.
ro_ro: ID formular invalid.

source: Form not found.
ro_ro: Formular negăsit.

source: No valid fields found in this form.
ro_ro: Nu s-au găsit câmpuri valide în acest formular.

source: You do not have permission to perform this action.
ro_ro: Nu aveți permisiunea de a efectua această acțiune.

source: Error saving generator.
ro_ro: Eroare la salvarea generatorului.

source: Error deleting generator.
ro_ro: Eroare la ștergerea generatorului.

source: Generator deleted successfully.
ro_ro: Generator șters cu succes.

source: Generator saved successfully.
ro_ro: Generator salvat cu succes.

source: Select a field
ro_ro: Selectează un câmp

source: An error occurred. Please try again.
ro_ro: A apărut o eroare. Vă rugăm să încercați din nou.

source: Are you sure you want to delete this generator?
ro_ro: Sigur doriți să ștergeți acest generator?

source: Gravity Forms WooCommerce Coupon
ro_ro: Cupon Gravity Forms WooCommerce

source: This email is sent when a coupon is generated through a Gravity Form.
ro_ro: Acest email este trimis când un cupon este generat prin intermediul unui formular Gravity.

source: Your Coupon Code
ro_ro: Codul tău de cupon

source: Your coupon code is: {coupon_code}
ro_ro: Codul tău de cupon este: {coupon_code}

source: No expiry
ro_ro: Fără expirare

source: Yes
ro_ro: Da

source: No
ro_ro: Nu

source: Unlimited
ro_ro: Nelimitat

source: No minimum
ro_ro: Fără minimum

source: No maximum
ro_ro: Fără maximum

source: All products
ro_ro: Toate produsele

source: All categories
ro_ro: Toate categoriile

source: Percentage
ro_ro: Procent

source: Fixed cart discount
ro_ro: Reducere fixă pentru coș

source: Fixed product discount
ro_ro: Reducere fixă pentru produs

source: Your Coupon Details
ro_ro: Detaliile cuponului tău

source: Coupon Code
ro_ro: Cod cupon

source: Discount
ro_ro: Reducere

source: Valid Until
ro_ro: Valabil până la

source: Minimum Spend
ro_ro: Cheltuieli minime

source: Usage Limit
ro_ro: Limită de utilizare

source: Applicable Products
ro_ro: Produse aplicabile

source: Thank you for your submission!
ro_ro: Mulțumim pentru trimitere!

source: Happy shopping!
ro_ro: Cumpărături plăcute!

source: List View
ro_ro: Vizualizare listă

source: Grid View
ro_ro: Vizualizare grilă

source: Delete
ro_ro: Șterge

source: Are you sure?
ro_ro: Sigur?

source: Invalid request
ro_ro: Cerere invalidă

source: Invalid nonce
ro_ro: Nonce invalid

source: Permission denied
ro_ro: Permisiune refuzată

source: Failed to delete generator
ro_ro: Eșec la ștergerea generatorului

source: Generator deleted successfully
ro_ro: Generator șters cu succes

source: Coupon Generators
ro_ro: Generatoare Cupoane

source: Form not found
ro_ro: Formular negăsit

source: Per coupon: Unlimited
ro_ro: Per cupon: Nelimitat

source: Per user: Unlimited
ro_ro: Per utilizator: Nelimitat

source: Per coupon: %d
ro_ro: Per cupon: %d

source: Per user: %d
ro_ro: Per utilizator: %d

source: Edit Generator
ro_ro: Editează Generator

source: Add Generator
ro_ro: Adaugă Generator

source: Update Generator
ro_ro: Actualizează Generator
